In [92]:
import pandas as pd

data = [
    ("James", "Sales", 3000),
    ("Michael", "Sales", 4600),
    ("Robert", "Sales", 4100),
    ("Maria", "Finance", 3000),
    ("James", "Sales", 3000),
    ("Scott", "Finance", 3300),
    ("Jen", "Finance", 3900),
    ("Jeff", "Marketing", 3000),
    ("Kumar", "Marketing", 2000),
    ("Saif", "Sales", 4100),
    ("Joe", "Sales", 4200),
    ("Venkat", "Sales", 4000),
]

df = pd.DataFrame(data, columns=["name", "dept", "salary"])
# Pandas is structured data, means we have metadata + data
# metadata is a schema, like column name, data type, column order

In [3]:
# col names

df.columns

Index(['name', 'dept', 'salary'], dtype='object')

In [4]:
# datatypes
df.dtypes
# remember, these values are stored as numpy

name      object
dept      object
salary     int64
dtype: object

In [5]:
# schema
df.info()

# look into #, where those 0, 1, 2 are labels created automatically

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    12 non-null     object
 1   dept    12 non-null     object
 2   salary  12 non-null     int64
dtypes: int64(1), object(2)
memory usage: 416.0+ bytes

In [6]:
# number of rows count
len(df)

12

In [7]:
# number of rows, 
# do you remember shape?? from numpy
df.shape[0]

12

In [8]:
# columns
df.shape[1]

3

In [9]:
# Rows × Columns
df.shape # (12, 3)

(12, 3)

In [10]:
# first 5 rows
df.head()

# those 0, 1, 2... are labels created by panda automatically, used in loc function

      name     dept  salary
0    James    Sales    3000
1  Michael    Sales    4600
2   Robert    Sales    4100
3    Maria  Finance    3000
4    James    Sales    3000

In [11]:
# First N rows
df.head(3)

      name   dept  salary
0    James  Sales    3000
1  Michael  Sales    4600
2   Robert  Sales    4100

In [13]:
# Last 5 rows
df.tail()
# df.tail(2) # for two rows

      name   dept  salary
10     Joe  Sales    4200
11  Venkat  Sales    4000

In [14]:
# Fetch rows (by row number / index)
# Pandas uses index (starts from 0)
# Get row by index (single row → Series)

df.loc[0]

name      James
dept      Sales
salary     3000
Name: 0, dtype: object

In [ ]:
# loc - label based
# iloc - index based

In [15]:
# or index-only

df.iloc[0]

name      James
dept      Sales
salary     3000
Name: 0, dtype: object

In [28]:
# discuss label vs index again..
df2 = df.copy()
df2.index = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110,120]
df2 # LOOK, the label is not 0, 1,2..., instead 10, 20...120

        name       dept  salary
10     James      Sales    3000
20   Michael      Sales    4600
30    Robert      Sales    4100
40     Maria    Finance    3000
50     James      Sales    3000
60     Scott    Finance    3300
70       Jen    Finance    3900
80      Jeff  Marketing    3000
90     Kumar  Marketing    2000
100     Saif      Sales    4100
110      Joe      Sales    4200
120   Venkat      Sales    4000

In [42]:
# another label example

df2 = df.set_index("name") # return new dataframe, second inplace = True for chaning inplace,not recommended

print (df2)
# now listen, name is label, not a data, pandas moved data name to label name
# now loc
print ('-' * 20)
print (df2.loc['James'])
print ('-' * 20)
print (df2.loc['Maria'])

print ('*' * 20)
print (df2.index)
print (df2.index.name)

print (df2.index.is_unique)

df2 = df2.reset_index() # reset index

print ('=' * 20)
print (df2.index)
print (df2.index.name)

print (df2.index.is_unique)

              dept  salary
name
James        Sales    3000
Michael      Sales    4600
Robert       Sales    4100
Maria      Finance    3000
James        Sales    3000
Scott      Finance    3300
Jen        Finance    3900
Jeff     Marketing    3000
Kumar    Marketing    2000
Saif         Sales    4100
Joe          Sales    4200
Venkat       Sales    4000
--------------------
        dept  salary
name
James  Sales    3000
James  Sales    3000
--------------------
dept      Finance
salary       3000
Name: Maria, dtype: object
********************
Index(['James', 'Michael', 'Robert', 'Maria', 'James', 'Scott', 'Jen', 'Jeff',
       'Kumar', 'Saif', 'Joe', 'Venkat'],
      dtype='object', name='name')
name
False
====================
RangeIndex(start=0, stop=12, step=1)
None
True

# INDEX & label

Use index when a column is:

# Unique or mostly unique

- Used for lookup, Fast lookups (hash-table behavior)
   df.set_index("order_id").loc[981234]  or df[df["order_id"] == 981234] will be faster


- Stable over time

example indexes

employee_id

order_id

date / timestamp

user_id

symbol (stocks)

# Time-series data (BIGGEST use case)

df = df.set_index("date")

df.loc["2025-01"]

df.resample("M").mean()

- Slicing by time
- Resampling
- Rolling windows

# Joins & alignment

Pandas automatically aligns data by index.

df1 + df2  # Rows are matched by index, not position.

df.groupby("dept").mean(), this internally create a index for the key, ie dept name

create columns like index (dept)	salary

In [16]:
# Get multiple rows
df.iloc[0:3]     # rows 0,1,2

      name   dept  salary
0    James  Sales    3000
1  Michael  Sales    4600
2   Robert  Sales    4100

In [17]:
# Get last row
df.iloc[-1]

name      Venkat
dept       Sales
salary      4000
Name: 11, dtype: object

In [18]:
# fetch single column (Series)
df["salary"]

0     3000
1     4600
2     4100
3     3000
4     3000
5     3300
6     3900
7     3000
8     2000
9     4100
10    4200
11    4000
Name: salary, dtype: int64

In [19]:
# multi column 
df[["name", "salary"]]

       name  salary
0     James    3000
1   Michael    4600
2    Robert    4100
3     Maria    3000
4     James    3000
5     Scott    3300
6       Jen    3900
7      Jeff    3000
8     Kumar    2000
9      Saif    4100
10      Joe    4200
11   Venkat    4000

In [20]:
# Fetch row + column
df.loc[0, "salary"]

3000

In [21]:
# Same using integer position
df.iloc[0, 2] # 2 is second column ie salary

3000

In [22]:
# Fetch multiple rows & columns together
# Rows 0–4, columns name & salary
df.loc[0:4, ["name", "salary"]]

      name  salary
0    James    3000
1  Michael    4600
2   Robert    4100
3    Maria    3000
4    James    3000

In [23]:
# Using iloc
df.iloc[0:5, [0, 2]]

      name  salary
0    James    3000
1  Michael    4600
2   Robert    4100
3    Maria    3000
4    James    3000

In [24]:
# Filter rows (basic WHERE clause)

df[df["salary"] > 4000]

       name   dept  salary
1   Michael  Sales    4600
2    Robert  Sales    4100
9      Saif  Sales    4100
10      Joe  Sales    4200

In [25]:
# Sales department only

df[df["dept"] == "Sales"]

       name   dept  salary
0     James  Sales    3000
1   Michael  Sales    4600
2    Robert  Sales    4100
4     James  Sales    3000
9      Saif  Sales    4100
10      Joe  Sales    4200
11   Venkat  Sales    4000

In [26]:
# Multiple conditions AND , note using single & (a python operator overload)

df[(df["dept"] == "Sales") & (df["salary"] > 4000)]

       name   dept  salary
1   Michael  Sales    4600
2    Robert  Sales    4100
9      Saif  Sales    4100
10      Joe  Sales    4200

In [45]:
# sorting
# Salary ascending (low → high)
sorted_df  = df.sort_values(by="salary", ascending=True) # or 
# df.sort_values("salary")
sorted_df

       name       dept  salary
8     Kumar  Marketing    2000
0     James      Sales    3000
3     Maria    Finance    3000
4     James      Sales    3000
7      Jeff  Marketing    3000
5     Scott    Finance    3300
6       Jen    Finance    3900
11   Venkat      Sales    4000
2    Robert      Sales    4100
9      Saif      Sales    4100
10      Joe      Sales    4200
1   Michael      Sales    4600

In [46]:
sorted_df = df.sort_values(by="salary", ascending=False)
sorted_df

       name       dept  salary
1   Michael      Sales    4600
10      Joe      Sales    4200
2    Robert      Sales    4100
9      Saif      Sales    4100
11   Venkat      Sales    4000
6       Jen    Finance    3900
5     Scott    Finance    3300
0     James      Sales    3000
3     Maria    Finance    3000
4     James      Sales    3000
7      Jeff  Marketing    3000
8     Kumar  Marketing    2000

In [47]:
# Sort by multiple columns
sorted_df = df.sort_values(by=["dept", "salary"], ascending=[True, True])
sorted_df

       name       dept  salary
3     Maria    Finance    3000
5     Scott    Finance    3300
6       Jen    Finance    3900
8     Kumar  Marketing    2000
7      Jeff  Marketing    3000
0     James      Sales    3000
4     James      Sales    3000
11   Venkat      Sales    4000
2    Robert      Sales    4100
9      Saif      Sales    4100
10      Joe      Sales    4200
1   Michael      Sales    4600

In [48]:
# df.sort_index(), df.sort_index(ascending=False) exists as well

In [49]:
# groupby,  Average salary per department

df.groupby("dept")["salary"].mean()

dept
Finance      3400.000000
Marketing    2500.000000
Sales        3857.142857
Name: salary, dtype: float64

In [50]:
# group by, Multiple aggregations
df.groupby("dept")["salary"].agg(["mean", "max", "count"])

                  mean   max  count
dept
Finance    3400.000000  3900      3
Marketing  2500.000000  3000      2
Sales      3857.142857  4600      7

In [51]:
df.groupby("dept").agg(
    avg_salary=("salary", "mean"),
    max_salary=("salary", "max"),
    emp_count=("name", "count")
)

            avg_salary  max_salary  emp_count
dept
Finance    3400.000000        3900          3
Marketing  2500.000000        3000          2
Sales      3857.142857        4600          7

In [52]:
# Group by TWO columns
# sample dataset not nice for this example
df.groupby(["dept", "name"])["salary"].sum()

dept       name
Finance    Jen        3900
           Maria      3000
           Scott      3300
Marketing  Jeff       3000
           Kumar      2000
Sales      James      6000
           Joe        4200
           Michael    4600
           Robert     4100
           Saif       4100
           Venkat     4000
Name: salary, dtype: int64

In [53]:
# Get data from a group, Get Sales department rows
# just get all values from group

df.groupby("dept").get_group("Sales")

       name   dept  salary
0     James  Sales    3000
1   Michael  Sales    4600
2    Robert  Sales    4100
4     James  Sales    3000
9      Saif  Sales    4100
10      Joe  Sales    4200
11   Venkat  Sales    4000

In [54]:
# groupby + aggregate (mean) + sort

df.groupby("dept")["salary"].mean().sort_values(ascending=False)

dept
Sales        3857.142857
Finance      3400.000000
Marketing    2500.000000
Name: salary, dtype: float64

In [59]:
# groupby + filter
# x["salary"] is numpy
df.groupby("dept").filter(lambda x: x["salary"].mean() > 3500)

       name   dept  salary
0     James  Sales    3000
1   Michael  Sales    4600
2    Robert  Sales    4100
4     James  Sales    3000
9      Saif  Sales    4100
10      Joe  Sales    4200
11   Venkat  Sales    4000

In [61]:
# groupby + transform (keep original rows)
# Add department average salary to each row
df["dept_avg_salary"] = df.groupby("dept")["salary"].transform("mean")
df # you can see new column added

       name       dept  salary  dept_avg_salary
0     James      Sales    3000      3857.142857
1   Michael      Sales    4600      3857.142857
2    Robert      Sales    4100      3857.142857
3     Maria    Finance    3000      3400.000000
4     James      Sales    3000      3857.142857
5     Scott    Finance    3300      3400.000000
6       Jen    Finance    3900      3400.000000
7      Jeff  Marketing    3000      2500.000000
8     Kumar  Marketing    2000      2500.000000
9      Saif      Sales    4100      3857.142857
10      Joe      Sales    4200      3857.142857
11   Venkat      Sales    4000      3857.142857

In [63]:
# drop the column
df2 = df.drop("dept_avg_salary", axis=1)
# dropped in df2, not in df
print (df2.columns)
print (df.columns) # not dropped

Index(['name', 'dept', 'salary'], dtype='object')

In [64]:
# multiple column

df2 = df2.drop(["dept", "salary"], axis=1)
print (df2.columns)

Index(['name'], dtype='object')

In [65]:
# modify original, generally not recommended, 
print (df.columns) # has dept_avg_salary
df.drop("dept_avg_salary", axis=1, inplace=True)
print (df.columns) #   dept_avg_salary removed in df, due to inplace change

Index(['name', 'dept', 'salary', 'dept_avg_salary'], dtype='object')
Index(['name', 'dept', 'salary'], dtype='object')

In [ ]:
# also pop, python del df['col'] exists or select the columns needed, leave the rest
# like df [ ['name', 'salary'] ], now we ignore debt,  

# remove if exists 
# df = df.drop(columns=["bonus"], errors="ignore")

In [ ]:
# apply function

# apply() runs a function on data (row-wise, column-wise, or group-wise)

"""
df.apply()	Each column or row
Series.apply()	Each value
groupby().apply()	Each group
"""

In [66]:
# df.apply() — row or column level
# Default: column-wise (axis=0)

df.apply(type) # type is a function. apply is a higher order function
# df level apply not useful

name      <class 'pandas.core.series.Series'>
dept      <class 'pandas.core.series.Series'>
salary    <class 'pandas.core.series.Series'>
dtype: object

In [67]:
# Row-wise (axis=1), apply
# try to apply 10% high to all the employees
# row level, this lamda function is called for each row
df.apply(lambda row: row["salary"] * 1.1, axis=1)

0     3300.0
1     5060.0
2     4510.0
3     3300.0
4     3300.0
5     3630.0
6     4290.0
7     3300.0
8     2200.0
9     4510.0
10    4620.0
11    4400.0
dtype: float64

In [68]:
# add the result as new column
df["salary_plus_bonus"] = df.apply(
    lambda row: row["salary"] + 500, axis=1
)

df

       name       dept  salary  salary_plus_bonus
0     James      Sales    3000               3500
1   Michael      Sales    4600               5100
2    Robert      Sales    4100               4600
3     Maria    Finance    3000               3500
4     James      Sales    3000               3500
5     Scott    Finance    3300               3800
6       Jen    Finance    3900               4400
7      Jeff  Marketing    3000               3500
8     Kumar  Marketing    2000               2500
9      Saif      Sales    4100               4600
10      Joe      Sales    4200               4700
11   Venkat      Sales    4000               4500

In [69]:
# Series.apply() — value level
# series is numpy array values for each column

# len is a function, get length of the name
df["name"].apply(len)

0     5
1     7
2     6
3     5
4     5
5     5
6     3
7     4
8     5
9     4
10    3
11    6
Name: name, dtype: int64

In [70]:
# department as upper case
df["dept"].apply(lambda x: x.upper())

0         SALES
1         SALES
2         SALES
3       FINANCE
4         SALES
5       FINANCE
6       FINANCE
7     MARKETING
8     MARKETING
9         SALES
10        SALES
11        SALES
Name: dept, dtype: object

In [74]:
# groupby().apply() — group level (advanced)
# g is one group
# g is also dataframe
# each g contains rows of ONE Department

# g["salary"].mean() compute aveage salary inside that group
# for sales
# (3000 + 4600 + 4100 + 3000 + 4100) / 5 = 3760
# g["salary"] > g["salary"].mean() is a boolean mask

"""
3000  > 3760 → False
4600  > 3760 → True
4100  > 3760 → True
3000  > 3760 → False
4100  > 3760 → True
"""

# g[ ... ] (filter rows) also a filter row, due to mask
df.groupby("dept").apply(
    lambda g: g[g["salary"] > g["salary"].mean()],
    include_groups=False
)

                 name  salary  salary_plus_bonus
dept
Finance   6       Jen    3900               4400
Marketing 7      Jeff    3000               3500
Sales     1   Michael    4600               5100
          2    Robert    4100               4600
          9      Saif    4100               4600
          10      Joe    4200               4700
          11   Venkat    4000               4500

In [77]:
# Transform
# transform returns the SAME number of rows as the original DataFrame

print (df.groupby("dept")["salary"].transform("mean"))

0     3857.142857
1     3857.142857
2     3857.142857
3     3400.000000
4     3857.142857
5     3400.000000
6     3400.000000
7     2500.000000
8     2500.000000
9     3857.142857
10    3857.142857
11    3857.142857
Name: salary, dtype: float64

In [78]:
# Transform
# transform returns the SAME number of rows as the original DataFrame
df[df["salary"] > df.groupby("dept")["salary"].transform("mean")]

       name       dept  salary  salary_plus_bonus
1   Michael      Sales    4600               5100
2    Robert      Sales    4100               4600
6       Jen    Finance    3900               4400
7      Jeff  Marketing    3000               3500
9      Saif      Sales    4100               4600
10      Joe      Sales    4200               4700
11   Venkat      Sales    4000               4500

In [79]:
# just using mean will reduces row, compare this with transform
df.groupby("dept")["salary"].mean()

# while groupby().transform("mean") — PRESERVES rows
# transform  feature
"""
Same row count as df
Each row gets its group’s mean
Broadcasted aggregation
"""

dept
Finance      3400.000000
Marketing    2500.000000
Sales        3857.142857
Name: salary, dtype: float64

In [80]:
# explode
# convert list like values in a column into multiple rows
# useful for lists, arrays, comma-separated values,JSON arrays

import pandas as pd

df_ex = pd.DataFrame({
    "name": ["James", "Maria"],
    "skills": [["Excel", "SQL"], ["Python", "Finance", "Excel"]]
})

df_ex

    name                    skills
0  James              [Excel, SQL]
1  Maria  [Python, Finance, Excel]

In [82]:
# explode columns

df_exploded = df_ex.explode("skills")
df_exploded

    name   skills
0  James    Excel
0  James      SQL
1  Maria   Python
1  Maria  Finance
1  Maria    Excel

In [89]:
# multiple columns exploding

df_ex = pd.DataFrame({
    "id": [1, 2],
    "skill": [["Python", "SQL"], ["Excel", "PowerBI"]],
    "level": [["Advanced", "Intermediate"], ["Basic", "Advanced"]]
})
# List lengths must match.
df_exploded = df_ex.explode(["skill", "level"])
print (df_exploded)

   id    skill         level
0   1   Python      Advanced
0   1      SQL  Intermediate
1   2    Excel         Basic
1   2  PowerBI      Advanced
----------

In [97]:
# queyr function
# query() filters rows using a string expression instead of df[condition]
# df.query("salary > 4000")
# df.query("dept == 'Sales' and salary > 4000")

print (df.query("salary > 4000"))
print ('-' * 30)
print (df.query("dept == 'Sales' and salary > 4000"))

       name   dept  salary
1   Michael  Sales    4600
2    Robert  Sales    4100
9      Saif  Sales    4100
10      Joe  Sales    4200
------------------------------
       name   dept  salary
1   Michael  Sales    4600
2    Robert  Sales    4100
9      Saif  Sales    4100
10      Joe  Sales    4200

In [98]:
# @ reference python variable, like fstring
min_salary = 4000

print (df.query("salary > @min_salary"))

       name   dept  salary
1   Michael  Sales    4600
2    Robert  Sales    4100
9      Saif  Sales    4100
10      Joe  Sales    4200

In [101]:
# write to csv 
df.to_csv("employees.csv")

In [100]:
# Exclude index - most common cases

df.to_csv("employees.csv", index=False)

In [103]:
# write few columns, delitter to TAB rather than comma
#   na_rep="NULL" for missing values
# no heaer header=False
#  mode="a", to append to existing file

df[["name", "dept", "salary"]].to_csv(
    "employees.csv",
    sep="\t", 
    index=False
)

In [ ]:
import pandas as pd

# read csv
# Header assumed in first row, index autocreated
# df = pd.read_csv("employees.csv")

# df = pd.read_csv("employees.csv", encoding="utf-8")